app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO "posts" ("created_at", "body", "updated_at") VALUES('2009-11-03 22:36:40', 'God i hate a teacher!', '2009-11-03 22:36:40')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 7)
DELETE FROM "posts" WHERE "id" = 7
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy