app/controllers/responses_controller.rb

SELECT * FROM "responses"
---
  def index
    @responses = Response.all

SELECT * FROM "responses" WHERE ("responses"."id" = 1)
---
  def show
    @response = Response.find(params[:id])

INSERT INTO "responses" ("created_at", "body", "updated_at", "post_id") VALUES('2009-11-03 22:48:11', 'hate her too!', '2009-11-03 22:48:11', NULL)
---
  def create
    @response = Response.new(params[:response])

    respond_to do |format|
      if @response.save

SELECT * FROM "responses" WHERE ("responses"."id" = 1)
DELETE FROM "responses" WHERE "id" = 1
---
  def destroy
    @response = Response.find(params[:id])
    @response.destroy