app/controllers/welcome_controller.rb

  def index
    @posts = Post.find(:all)
---
SELECT * FROM "posts" WHERE ("posts"."id" = '--- :random